{"pageProps":{"game":{"date":"24-09-2025","brand":"Subway Surfers","orientation":0,"title":"Subway Surfers: Berlin Unblocked Online","name":["Subway Surfers: Berlin","subway-surfers-berlin"],"thumb":"/assets/thumb/subway-surfers-berlin.png","thumb_big":"/assets/thumb/subway-surfers-berlin.png","path":["/game/subway-surfers-berlin","https://newunblockedgames.gitlab.io"],"iframe":"https://genizymath.github.io/iframe/133.html","Walkthrough":"https://www.youtube.com/embed/","s_dis":"Subway Surfers: Berlin brings players to the vibrant EDM scene and landmarks of Berlin, playable online unblocked with new characters, outfits, boards, and city-themed collectibles.","l_dis":"<h1>Subway Surfers: Berlin – Dash Through the Musical Streets of Germany</h1>\n  <p><strong>Subway Surfers: Berlin</strong> immerses players in Berlin's iconic streets and EDM scene. Run, jump, and slide along city tracks, dodging trains, barriers, and collecting coins, musical items, and power-ups.</p>\n\n  <h2 class=\"H22\">What is Subway Surfers: Berlin?</h2>\n  <p>This edition is part of the World Tour series, featuring Berlin cityscapes, the EDM music theme, a limited-edition musician character named Nina with her Cyberpunk Outfit, and the Rockstar hoverboard.</p>\n\n  <h2 class=\"H22\">How to Play Subway Surfers: Berlin?</h2>\n  <ul>\n    <li><strong>Swipe Controls:</strong> Swipe up to jump, down to roll, left/right to switch lanes.</li>\n    <li><strong>Collect Coins & Musical Items:</strong> Gather coins, musical-themed collectibles, and other items to unlock Weekly Hunt rewards like hoverboards and keys.</li>\n    <li><strong>Dodge Obstacles:</strong> Avoid trains, barriers, and Berlin-themed hazards while maintaining your run.</li>\n    <li><strong>Use Power-Ups:</strong> Activate magnets, jetpacks, and hoverboards to extend your run and maximize your score.</li>\n  </ul>\n\n  <h2 class=\"H22\">Why Play Subway Surfers: Berlin Unblocked?</h2>\n  <p>Experience the musical streets and iconic landmarks of Berlin in <strong>Subway Surfers: Berlin</strong> online without restrictions, unlock new characters, outfits, boards, and city-themed collectibles.</p>\n\n  <h2 class=\"H22\">Key Features</h2>\n  <ul>\n    <li><strong>Berlin Environment:</strong> Explore famous city landmarks like the Brandenburg Gate and vibrant EDM-themed streets.</li>\n    <li><strong>Exclusive Characters & Boards:</strong> Unlock Nina with her Cyberpunk Outfit and the Rockstar hoverboard.</li>\n    <li><strong>Endless Runner Gameplay:</strong> Classic swipe-based controls with a musical, Berlin twist.</li>\n    <li><strong>Special Collectibles:</strong> Collect musical items for Weekly Hunt rewards.</li>\n    <li><strong>Unblocked Online:</strong> Play instantly in your browser anywhere.</li>\n  </ul>\n\n  <h2 class=\"H22\">Master Berlin's Subway Tracks!</h2>\n  <p>Run, jump, and slide through <strong>Subway Surfers: Berlin</strong> to beat obstacles, collect rewards, and enjoy the musical city environment!</p>\n\n  <script type=\"application/ld+json\">\n  {\n    \"@context\": \"https://schema.org\",\n    \"@type\": \"FAQPage\",\n    \"mainEntity\": [\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What is Subway Surfers: Berlin?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"It is a Berlin-themed edition of Subway Surfers featuring EDM streets, new characters, boards, and musical collectibles.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"How do you play Subway Surfers: Berlin?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Swipe to jump, roll, and switch lanes while collecting coins, musical items, and using power-ups to survive as long as possible.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Is Subway Surfers: Berlin unblocked?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes, this edition is playable online without restrictions.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Who are the characters in Berlin?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"The limited-edition musician character Nina with her Cyberpunk Outfit.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What are the special collectibles in Berlin?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Players collect musical-themed items for Weekly Hunt rewards like hoverboards and keys.\"\n        }\n      }\n    ]\n  }\n  </script>\n  ","tag":["Subway Surfers","Endless Runner","Berlin","Germany","Unblocked","EDM"],"rating":[4.8,5321,478]}},"__N_SSG":true}