{"pageProps":{"game":{"date":"11-10-2025","brand":"Bubble Bobble: Old and New","orientation":1,"title":"Bubble Bobble: Old and New GBA – Play Bub & Bob Online","name":["Bubble Bobble: Old and New","bubble-bobble-old-and-new"],"thumb":"/assets/thumb/bubble-bobble-old-and-new.png","thumb_big":"/assets/thumb/bubble-bobble-old-and-new.png","path":["/game/bubble-bobble-old-and-new","https://newunblockedgames.gitlab.io"],"iframe":"https://bobzgames.github.io/GBA/launcher.html#bubblebobble","Walkthrough":"https://www.youtube.com/embed/","s_dis":"Bubble Bobble: Old and New is a GBA platformer featuring Bub and Bob, 100 levels, classic and updated graphics, single-player and co-op modes, power-ups, and a save system with battery backup.","l_dis":"<h1>Play Bubble Bobble: Old and New GBA Online – Classic Platformer Adventure</h1>\n  <p><strong>Bubble Bobble: Old and New</strong> brings the beloved bubble-blowing dragons, Bub and Bob, to the Game Boy Advance. Players navigate 100 levels, trap enemies in bubbles, and rescue their girlfriends, enjoying both the original arcade experience and a modernized new version with enhanced graphics and sound.</p>\n\n  <h2 class=\"H22\">What is Bubble Bobble: Old and New?</h2>\n  <p><strong>Bubble Bobble: Old and New</strong> is a platformer featuring both the classic arcade game and a newly updated version. Players control Bub and Bob, blow bubbles to trap enemies, collect power-ups, and unlock bonus lives by gathering letter bubbles to spell \"EXTEND.\" The game supports single-player and cooperative multiplayer modes, with battery backup and two save files for progress tracking.</p>\n\n  <h2 class=\"H22\">How to Play Bubble Bobble: Old and New</h2>\n  <ul>\n    <li><strong>Control Bub & Bob:</strong> Navigate each level, jump, and blow bubbles to trap enemies.</li>\n    <li><strong>Pop Bubbles:</strong> Defeat enemies by popping the bubbles you trap them in.</li>\n    <li><strong>Collect Power-Ups:</strong> Gain new abilities and advantages to progress through levels.</li>\n    <li><strong>Spell \"EXTEND\":</strong> Gather letter bubbles to earn bonus lives.</li>\n    <li><strong>Play Co-op:</strong> Team up with a friend for cooperative gameplay to tackle levels together.</li>\n  </ul>\n\n  <h2 class=\"H22\">Why Play Bubble Bobble: Old and New Online?</h2>\n  <p>Play <strong>Bubble Bobble: Old and New</strong> unblocked in your browser for free. Enjoy both the nostalgic arcade version and the updated edition with enhanced graphics and sound, featuring classic platforming action on GBA.</p>\n\n  <h2 class=\"H22\">Key Features</h2>\n  <ul>\n    <li><strong>Classic and New Versions:</strong> Experience the original arcade game and a newly updated GBA version.</li>\n    <li><strong>100 Levels:</strong> Challenge yourself with a wide variety of stages.</li>\n    <li><strong>Single-Player & Co-op:</strong> Play alone or team up with a friend for cooperative fun.</li>\n    <li><strong>Power-Ups & Bonuses:</strong> Use special bubbles and collect letter bubbles to gain extra lives.</li>\n    <li><strong>Save System:</strong> Battery backup with two save files ensures your progress is never lost.</li>\n  </ul>\n\n  <h2 class=\"H22\">Help Bub & Bob Rescue Their Girlfriends!</h2>\n  <p>Join <strong>Bub and Bob</strong> in <strong>Bubble Bobble: Old and New</strong> for a fun-filled platforming adventure. Trap enemies, collect bonuses, and progress through 100 exciting levels—play unblocked online now!</p>\n\n  <script type=\"application/ld+json\">\n  {\n    \"@context\": \"https://schema.org\",\n    \"@type\": \"FAQPage\",\n    \"mainEntity\": [\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What is Bubble Bobble: Old and New for GBA?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Bubble Bobble: Old and New is a GBA platformer featuring Bub and Bob, combining the classic arcade game with an updated version, including 100 levels, power-ups, and multiplayer modes.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"How do you play Bubble Bobble: Old and New?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Control Bub and Bob, trap enemies in bubbles, pop them to defeat foes, collect power-ups and letters to gain extra lives, and explore 100 levels either solo or cooperatively.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Can you play Bubble Bobble: Old and New online?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes, the game can be played unblocked online directly in your browser without downloads or emulators.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What makes Bubble Bobble: Old and New special?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"It offers both the classic arcade experience and a modernized version, with 100 levels, cooperative multiplayer, power-ups, letter bonuses, and a battery-backed save system.\"\n        }\n      }\n    ]\n  }\n  </script>\n  ","tag":["Bubble Bobble","Platformer","Adventure","Action","Co-op","GBA","Puzzle","Unblocked","Browser Game"],"rating":[4.8,1305,110]}},"__N_SSG":true}