{"pageProps":{"game":{"date":"11-10-2025","brand":"Earthworm Jim","orientation":1,"title":"Earthworm Jim GBA – Play Classic Run-and-Gun Online","name":["Earthworm Jim","earthworm-jim"],"thumb":"/assets/thumb/earthworm-jim.png","thumb_big":"/assets/thumb/earthworm-jim.png","path":["/game/earthworm-jim","https://newunblockedgames.gitlab.io"],"iframe":"https://bobzgames.github.io/GBA/launcher.html#earthwormjim","Walkthrough":"https://www.youtube.com/embed/","s_dis":"Earthworm Jim for Game Boy Advance is a 2D run-and-gun platformer where players control a worm in a super suit, battling weird enemies across 7 challenging levels filled with humor and action.","l_dis":"<h1>Play Earthworm Jim GBA Online – Classic Run-and-Gun Platformer</h1>\n  <p><strong>Earthworm Jim</strong> for the Game Boy Advance brings the cult-classic 16-bit platformer to handheld consoles. Players step into the slimy suit of Jim, an ordinary earthworm turned hero, as he whips, blasts, and jumps his way through a universe of wacky enemies and bizarre levels.</p>\n\n  <h2 class=\"H22\">What is Earthworm Jim (GBA)?</h2>\n  <p><strong>Earthworm Jim GBA</strong> is a portable version of the original Sega Genesis and SNES hit. This version includes 7 levels of classic run-and-gun gameplay, plus GBA-exclusive minigames and power-ups. While it retains the humor and style of the original, it also introduces some technical quirks like slower animation and inconsistent performance.</p>\n\n  <h2 class=\"H22\">How to Play Earthworm Jim GBA</h2>\n  <ul>\n    <li><strong>Run and Shoot:</strong> Use Jim’s plasma blaster to take down enemies.</li>\n    <li><strong>Whip Attack:</strong> Use Jim’s worm head as a whip to defeat foes or swing across gaps.</li>\n    <li><strong>Helicopter Glide:</strong> Spin Jim’s head like a propeller to slow falls and reach distant platforms.</li>\n    <li><strong>Collect Power-ups:</strong> Pick up ammo, health, and GBA-exclusive items.</li>\n    <li><strong>Battle Crazy Bosses:</strong> Face off against memorable villains like Psy-Crow and Queen Slug-for-a-Butt.</li>\n  </ul>\n\n  <h2 class=\"H22\">Why Play Earthworm Jim GBA Online?</h2>\n  <p>Play <strong>Earthworm Jim GBA</strong> unblocked and free in your browser. Experience the bizarre humor, creative level design, and classic gameplay that made the series famous—all without downloads or emulators. Despite its quirks, this version offers portable fun for fans of retro action games.</p>\n\n  <h2 class=\"H22\">Key Features</h2>\n  <ul>\n    <li><strong>7 Classic Levels:</strong> Battle through surreal worlds full of wild enemies.</li>\n    <li><strong>Signature Weapons:</strong> Use Jim’s blaster and whip for combat and movement.</li>\n    <li><strong>GBA-Exclusive Minigames:</strong> Enjoy handheld-only bonus content.</li>\n    <li><strong>Cartoon Humor:</strong> Filled with slapstick comedy and outlandish visuals.</li>\n    <li><strong>Unblocked Gameplay:</strong> Play instantly online, anytime, anywhere.</li>\n  </ul>\n\n  <h2 class=\"H22\">Join Jim on His Out-of-This-World Adventure!</h2>\n  <p>Suit up as <strong>Earthworm Jim</strong> and take on an army of eccentric villains in this unforgettable platforming adventure. Blast, whip, and spin your way through space and save the day—now playable online for free!</p>\n\n  <script type=\"application/ld+json\">\n  {\n    \"@context\": \"https://schema.org\",\n    \"@type\": \"FAQPage\",\n    \"mainEntity\": [\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What is Earthworm Jim GBA?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Earthworm Jim for Game Boy Advance is a 2D platformer and run-and-gun game based on the original Sega Genesis and SNES versions, featuring 7 levels, unique bosses, and GBA-exclusive minigames.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"How do you play Earthworm Jim GBA?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Players use Jim’s blaster and head whip to defeat enemies, swing across obstacles, and glide to safety while battling quirky bosses through 7 action-packed stages.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Can you play Earthworm Jim GBA online?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes, you can play Earthworm Jim GBA unblocked and for free in your browser with no downloads or emulators required.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What’s new in the GBA version of Earthworm Jim?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"The GBA version includes exclusive minigames, new power-ups, and portable play, though it features some minor performance issues compared to the original console versions.\"\n        }\n      }\n    ]\n  }\n  </script>\n  ","tag":["Earthworm Jim","Platformer","Action","Shooter","Retro","Comedy","GBA","Unblocked","Browser Game"],"rating":[4.6,1120,90]}},"__N_SSG":true}