{"pageProps":{"game":{"date":"13-10-2025","brand":"Earthworm Jim 2","orientation":1,"title":"Earthworm Jim 2 – Play Online","name":["Earthworm Jim 2","earthworm-jim-2"],"thumb":"/assets/thumb/earthworm-jim-2.png","thumb_big":"/assets/thumb/earthworm-jim-2.png","path":["/game/earthworm-jim-2","https://bobzgames.github.io/GBA/"],"iframe":"https://bobzgames.github.io/GBA/launcher.html#earthwormjim2","Walkthrough":"https://www.youtube.com/embed/","s_dis":"Earthworm Jim 2 is a run-and-gun platformer where players control Jim on a chaotic mission to rescue Princess What's-Her-Name, featuring quirky levels, weapons, and humorous gameplay.","l_dis":"<h1>Play Earthworm Jim 2 Online – Classic GBA Platformer</h1>\n  <p><strong>Earthworm Jim 2</strong> brings the wacky and irreverent platforming adventure of the original to the Game Boy Advance. Players take control of Jim, the super-powered earthworm, as he embarks on a mission to rescue Princess What's-Her-Name, navigating bizarre levels full of unpredictable challenges and enemies.</p>\n\n  <h2 class=\"H22\">What is Earthworm Jim 2?</h2>\n  <p><strong>Earthworm Jim 2</strong> is a 1995 run-and-gun platformer developed by Shiny Entertainment. It is known for its highly varied and unorthodox gameplay, combining traditional platforming with level-specific challenges, including rescuing puppies, defeating Psy-Crow, and using Jim’s snot whip and new weapons to overcome obstacles. The game maintains the series’ signature humor and eclectic character design.</p>\n\n  <h2 class=\"H22\">How to Play Earthworm Jim 2</h2>\n  <ul>\n    <li><strong>Run and Jump:</strong> Navigate tricky platforms and avoid environmental hazards.</li>\n    <li><strong>Use Jim’s Weapons:</strong> Wield blasters, the snot whip, and other tools to defeat enemies.</li>\n    <li><strong>Complete Level-Specific Goals:</strong> Each stage has unique objectives and challenges.</li>\n    <li><strong>Rescue Characters:</strong> Save puppies and assist other characters along the way.</li>\n    <li><strong>Defeat Bosses:</strong> Outsmart Psy-Crow and other eccentric villains in inventive battles.</li>\n  </ul>\n\n  <h2 class=\"H22\">Why Play Earthworm Jim 2 Online?</h2>\n  <p>Play <strong>Earthworm Jim 2</strong> unblocked in your browser to experience one of the most creative and humorous platformers of the 90s. Enjoy a mix of action, puzzles, and comedy without downloads or emulators.</p>\n\n  <h2 class=\"H22\">Key Features</h2>\n  <ul>\n    <li><strong>Quirky Platforming:</strong> Highly varied levels with unique objectives.</li>\n    <li><strong>Humorous Story and Characters:</strong> The signature irreverent tone of the series.</li>\n    <li><strong>New Weapons:</strong> Jim's arsenal includes blasters, snot whip, and more.</li>\n    <li><strong>Boss Battles:</strong> Face off against iconic foes like Psy-Crow.</li>\n    <li><strong>Unblocked Play:</strong> Play directly online in your browser with no setup required.</li>\n  </ul>\n\n  <h2 class=\"H22\">Join Jim on His Absurd Adventure!</h2>\n  <p>Guide <strong>Earthworm Jim</strong> through a chaotic and humorous world filled with wacky enemies, bizarre levels, and unpredictable challenges. Rescue Princess What's-Her-Name and enjoy the timeless action-platforming fun—play online today!</p>\n\n  <script type=\"application/ld+json\">\n  {\n    \"@context\": \"https://schema.org\",\n    \"@type\": \"FAQPage\",\n    \"mainEntity\": [\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What is Earthworm Jim 2?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Earthworm Jim 2 is a run-and-gun platformer for GBA where players control Jim to rescue Princess What's-Her-Name through quirky and challenging levels.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"How do you play Earthworm Jim 2?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Players run, jump, and use weapons like blasters and the snot whip, completing level-specific objectives and defeating bosses along the way.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Can you play Earthworm Jim 2 online?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes, Earthworm Jim 2 can be played unblocked online in your browser for free with no downloads or emulators required.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What makes Earthworm Jim 2 unique?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"The game combines traditional platforming with highly varied and humorous level-specific challenges, quirky characters, and inventive gameplay mechanics.\"\n        }\n      }\n    ]\n  }\n  </script>\n  ","tag":["Earthworm Jim","Platformer","Action","Run and Gun","GBA","Retro","Unblocked","Browser Game","Humor","Adventure"],"rating":[4.8,1280,105]}},"__N_SSG":true}