{"pageProps":{"game":{"date":"07-10-2025","brand":"Run 3","orientation":0,"title":"Run 3 Unblocked – Endless Space Tunnel Runner","name":["run 3","run3","run 3 game","run 3 unblocked"],"thumb":"/assets/thumb/run-3.png","thumb_big":"/assets/thumb/run-3.png","path":["/game/run-3","https://newunblockedgames.gitlab.io"],"iframe":"https://ubgwtf.gitlab.io/run-3/","Walkthrough":"https://www.youtube.com/embed/","s_dis":"Run 3 is a physics-based, endless runner where players control a small alien navigating space tunnels, jumping, running, and flipping gravity to avoid falling while unlocking new characters with unique abilities.","l_dis":"<h1>Play Run 3 Unblocked – Endless Space Tunnel Runner</h1>\n  <p><strong>Run 3</strong> challenges players to traverse endless space tunnels filled with gaps, traps, and challenging tiles. Players control a small alien character, running and jumping while avoiding falling into the void. The game features gravity-changing mechanics by touching walls, a variety of unlockable characters with unique abilities, and intricate tunnels that test reflexes, timing, and strategy.</p>\n\n  <h2 class=\"H22\">What is Run 3?</h2>\n  <p>Run 3, developed by player_03, is a physics-based, side-scrolling endless runner set in space. Unlike traditional runners, Run 3 includes gravity mechanics where players can run on walls and ceilings, navigate complex tunnels, and face unique tile types and traps. The game emphasizes skill, precision, and strategic character selection to progress further and explore hidden levels.</p>\n\n  <h2 class=\"H22\">How to Play Run 3</h2>\n  <ul>\n    <li><strong>Movement:</strong> Use arrow keys or [WASD] to move the character left and right.</li>\n    <li><strong>Jump:</strong> Press the spacebar to jump across gaps.</li>\n    <li><strong>Gravity Flip:</strong> Touch walls or certain tiles to run along ceilings or flip gravity.</li>\n    <li><strong>Unlock Characters:</strong> Use progress to unlock aliens with special abilities like higher jumps or faster speed.</li>\n    <li><strong>Collect Bonuses:</strong> Explore tunnels to find secrets and extend your run.</li>\n  </ul>\n\n  <h2 class=\"H22\">Why Play Run 3 Unblocked?</h2>\n  <p>Enjoy <strong>Run 3</strong> unblocked online, anywhere in your browser. Navigate endless tunnels, unlock characters, and challenge yourself with tricky obstacles without restrictions.</p>\n\n  <h2 class=\"H22\">Key Features</h2>\n  <ul>\n    <li><strong>Endless Space Tunnels:</strong> Navigate infinite levels of challenging tunnels.</li>\n    <li><strong>Gravity Mechanics:</strong> Flip gravity and run on walls and ceilings to progress.</li>\n    <li><strong>Unlockable Characters:</strong> New aliens with unique abilities add strategy to the gameplay.</li>\n    <li><strong>Challenging Obstacles:</strong> Avoid traps, gaps, and special tiles.</li>\n    <li><strong>Skill and Strategy:</strong> Requires timing, precision, and careful planning to survive.</li>\n  </ul>\n\n  <h2 class=\"H22\">Master the Endless Tunnel Challenge!</h2>\n  <p>Run, jump, and flip gravity in <strong>Run 3</strong> to travel as far as possible, unlock new characters, and explore endless space tunnels.</p>\n\n  <script type=\"application/ld+json\">\n  {\n    \"@context\": \"https://schema.org\",\n    \"@type\": \"FAQPage\",\n    \"mainEntity\": [\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What is Run 3?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Run 3 is a physics-based endless runner where players navigate aliens through space tunnels, jumping and flipping gravity to avoid falling and unlocking new characters.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"How do you play Run 3?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Use arrow keys or WASD to move, spacebar to jump, touch walls to flip gravity, and unlock characters to gain unique abilities.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Is Run 3 unblocked?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes, this version of Run 3 is playable unblocked directly in your browser.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Who are the characters in Run 3?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Players can unlock and control a variety of alien characters with special abilities like higher jumps or faster speed.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Are there special tiles in Run 3?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes, the game includes special tiles and traps that require skill and timing to avoid falling into the void.\"\n        }\n      }\n    ]\n  }\n  </script>\n  ","tag":["Run 3","Endless Runner","Gravity Flip","Alien","Space Tunnel","Unblocked","Flash"],"rating":[4.8,3200,295]}},"__N_SSG":true}