{"pageProps":{"game":{"date":"07-10-2025","brand":"Run 2","orientation":0,"title":"Run 2 Unblocked – 3D Gravity-Flip Platformer Online","name":["Run 2","run-2"],"thumb":"/assets/thumb/run-2.png","thumb_big":"/assets/thumb/run-2.png","path":["/game/run-2","https://newunblockedgames.gitlab.io"],"iframe":"https://macvg-games.github.io/action-games/run-2/","Walkthrough":"https://www.youtube.com/embed/","s_dis":"Run 2 is a 3D platformer where players control a Runner or Skater through gravity-defying tunnels and open levels, jumping and flipping gravity to reach the exit while collecting secret orbs.","l_dis":"<h1>Play Run 2 Unblocked – 3D Gravity-Flip Platformer</h1>\n  <p><strong>Run 2</strong> is a thrilling 3D platformer where players navigate complex levels filled with obstacles, jumps, and gravity-based challenges. Players can choose between two characters: <strong>Runner</strong>, with normal speed and more precise control, or <strong>Skater</strong>, who moves faster but requires sharper reflexes. The game tests coordination, memory, and concentration as you traverse floating pathways and collect secret orbs to unlock bonus levels.</p>\n\n  <h2 class=\"H22\">What is Run 2?</h2>\n  <p>Run 2, developed by player_03 and other contributors, is a sequel to the original Run game. It combines 3D perspective with intricate level design that requires players to use momentum, timing, and gravity-flipping mechanics to avoid falling into the void. The game includes both tunnel levels and open-space stages, providing diverse challenges that increase in difficulty as you progress.</p>\n\n  <h2 class=\"H22\">How to Play Run 2</h2>\n  <ul>\n    <li><strong>Movement:</strong> Use arrow keys or [WASD] to move the character.</li>\n    <li><strong>Jump:</strong> Press the spacebar to jump across gaps or onto platforms.</li>\n    <li><strong>Gravity Flip:</strong> In certain levels, control gravity to walk on walls or ceilings.</li>\n    <li><strong>Collect Orbs:</strong> Gather hidden orbs to unlock bonus levels and hidden pathways.</li>\n    <li><strong>Choose Your Character:</strong> Runner for precision, Skater for speed and momentum-based gameplay.</li>\n  </ul>\n\n  <h2 class=\"H22\">Why Play Run 2 Unblocked?</h2>\n  <p>Enjoy <strong>Run 2 unblocked</strong> directly in your browser. Experience challenging 3D platforming without restrictions, perfect for improving reflexes, timing, and spatial reasoning while enjoying the game's unique gravity-flipping mechanics.</p>\n\n  <h2 class=\"H22\">Key Features</h2>\n  <ul>\n    <li><strong>3D Platforming:</strong> Navigate dynamic and floating pathways in 3D environments.</li>\n    <li><strong>Gravity Mechanics:</strong> Flip gravity to traverse ceilings and walls.</li>\n    <li><strong>Two Playable Characters:</strong> Runner for precise control, Skater for faster movement.</li>\n    <li><strong>Secret Orbs:</strong> Collect orbs to unlock bonus levels and achievements.</li>\n    <li><strong>Challenging Levels:</strong> Progressive difficulty with tunnels, open-space stages, and precise jumps.</li>\n  </ul>\n\n  <h2 class=\"H22\">Master the Gravity-Defying Challenge!</h2>\n  <p>Run, jump, and flip gravity in <strong>Run 2</strong> to reach the exit, unlock hidden paths, and test your reflexes in this iconic 3D platformer.</p>\n\n  <script type=\"application/ld+json\">\n  {\n    \"@context\": \"https://schema.org\",\n    \"@type\": \"FAQPage\",\n    \"mainEntity\": [\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What is Run 2?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Run 2 is a 3D platformer where players control a Runner or Skater through complex levels, using jumps and gravity-flipping mechanics to reach the exit and collect secret orbs.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"How do you play Run 2?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Use arrow keys or WASD to move, spacebar to jump, flip gravity when necessary, and collect orbs to unlock bonus levels.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Is Run 2 unblocked?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes, this online version allows players to access Run 2 unblocked directly in a browser.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Who are the characters in Run 2?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Players can choose the Runner for precision control or the Skater for faster momentum-based gameplay.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Are there secret levels in Run 2?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes, collecting hidden orbs unlocks bonus levels and secret paths throughout the game.\"\n        }\n      }\n    ]\n  }\n  </script>\n  ","tag":["Run 2","3D Platformer","Gravity Flip","Runner","Skater","Unblocked"],"rating":[4.7,2100,185]}},"__N_SSG":true}