{"pageProps":{"game":{"date":"24-09-2025","brand":"Subway Surfers","orientation":0,"title":"Subway Surfers: London Unblocked Online","name":["Subway Surfers: London","subway-surfers-london"],"thumb":"/assets/thumb/subway-surfers-london.png","thumb_big":"/assets/thumb/subway-surfers-london.png","path":["/game/subway-surfers-london","https://newunblockedgames.gitlab.io"],"iframe":"https://genizymath.github.io/iframe/138.html","Walkthrough":"https://www.youtube.com/embed/","s_dis":"Subway Surfers: London takes the endless runner action to the iconic streets and subways of London, playable online unblocked with new characters, outfits, and city-themed obstacles.","l_dis":"<h1>Subway Surfers: London – Dash Through the Historic UK Capital</h1>\n  <p><strong>Subway Surfers: London</strong> immerses players in the bustling streets and subway lines of London. Run, jump, and slide along city-themed tracks, dodging trains, barriers, and collecting coins, tokens, and power-ups.</p>\n\n  <h2 class=\"H22\">What is Subway Surfers: London?</h2>\n  <p>This edition is part of the World Tour series, featuring London subway environments, characters like Jake, Tricky, and Fresh, and city-inspired outfits such as references to the Peaky Blinders series. Collect special items during Weekly Hunts for rewards.</p>\n\n  <h2 class=\"H22\">How to Play Subway Surfers: London?</h2>\n  <ul>\n    <li><strong>Swipe Controls:</strong> Swipe up to jump, down to roll, left/right to switch lanes.</li>\n    <li><strong>Collect Coins & Tokens:</strong> Gather coins, city-themed items, and other collectibles to unlock Weekly Hunt rewards like hoverboards and keys.</li>\n    <li><strong>Dodge Obstacles:</strong> Avoid trains, barriers, and London-themed hazards while maintaining your run.</li>\n    <li><strong>Use Power-Ups:</strong> Activate magnets, jetpacks, and hoverboards to extend your run and maximize your score.</li>\n  </ul>\n\n  <h2 class=\"H22\">Why Play Subway Surfers: London Unblocked?</h2>\n  <p>Experience the historic and iconic sights of London in <strong>Subway Surfers: London</strong> online without restrictions, unlock new characters, outfits, boards, and city-themed collectibles.</p>\n\n  <h2 class=\"H22\">Key Features</h2>\n  <ul>\n    <li><strong>London Environment:</strong> Explore iconic streets, landmarks, and subway stations of London.</li>\n    <li><strong>Exclusive Characters & Boards:</strong> Play as Jake, Tricky, Fresh, and unlock Peaky Blinders-inspired outfits.</li>\n    <li><strong>Endless Runner Gameplay:</strong> Classic swipe-based controls with a London twist.</li>\n    <li><strong>Special Collectibles:</strong> Participate in Weekly Hunts for tokens and rewards.</li>\n    <li><strong>Unblocked Online:</strong> Play instantly in your browser anywhere.</li>\n  </ul>\n\n  <h2 class=\"H22\">Master London's Subway Tracks!</h2>\n  <p>Run, jump, and slide through <strong>Subway Surfers: London</strong> to beat obstacles, collect rewards, and enjoy the city's unique environment!</p>\n\n  <script type=\"application/ld+json\">\n  {\n    \"@context\": \"https://schema.org\",\n    \"@type\": \"FAQPage\",\n    \"mainEntity\": [\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What is Subway Surfers: London?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"It is a London-themed edition of Subway Surfers featuring city subway environments, new characters, outfits, and collectibles.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"How do you play Subway Surfers: London?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Swipe to jump, roll, and switch lanes while collecting coins, city-themed items, and using power-ups to survive as long as possible.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Is Subway Surfers: London unblocked?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes, this edition is playable online without restrictions.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Who are the characters in London?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Players can play as Jake, Tricky, and Fresh with special city-themed outfits.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What are the special collectibles in London?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Players collect city-themed items during Weekly Hunts for rewards like hoverboards and keys.\"\n        }\n      }\n    ]\n  }\n  </script>\n  ","tag":["Subway Surfers","Endless Runner","London","UK","Unblocked"],"rating":[4.8,5321,478]}},"__N_SSG":true}