{"pageProps":{"game":{"date":"15-11-2025","brand":"Endoparasitic","orientation":0,"title":"Endoparasitic Unblocked – Play Free One-Armed Survival Horror Game Online","name":["Endoparasitic","endoparasitic"],"thumb":"/assets/thumb/endoparasitic.png","thumb_big":"/assets/thumb/endoparasitic.png","path":["/game/endoparasitic","https://newunblockedgames.gitlab.io"],"iframe":"https://genizymath.github.io/iframe/286.html","Walkthrough":"https://www.youtube.com/embed/","s_dis":"Play Endoparasitic Unblocked, a brutal one-armed survival horror game where you fight mutants, craft vaccines, solve puzzles, and escape a deadly parasite-infected research lab.","l_dis":"\n    <h1>Endoparasitic Unblocked – One-Armed Tactical Survival Horror</h1>\n    <p><strong>Endoparasitic Unblocked</strong> is a uniquely intense survival horror game where every action is manual, deliberate, and dangerous. You play as <strong>Sent</strong>, a scientist trapped in a secret research lab on an asteroid after an outbreak mutates everyone around you. With only one arm and a parasite eating you from the inside, survival requires precision, planning, and grit.</p>\n\n    <h2 class=\"H22\">What is Endoparasitic Unblocked?</h2>\n    <p><strong>Endoparasitic Unblocked</strong> stands out as a tactical horror title where you perform every action manually—from loading bullets one by one to dragging yourself across rooms. The parasite inside you constantly drains your health, forcing you to manage vaccine injections while solving puzzles and fighting off terrifying, mutated creatures.</p>\n\n    <h2 class=\"H22\">How to Play Endoparasitic Unblocked?</h2>\n    <ul>\n      <li><strong>Manual Combat:</strong> Reload bullets individually, aim carefully, and manage your limited ammo.</li>\n      <li><strong>Parasite Management:</strong> Use vaccines to delay the infection as it constantly drains your health.</li>\n      <li><strong>Environmental Puzzles:</strong> Solve lab-based puzzles to unlock doors and progress your research.</li>\n      <li><strong>Stealth & Strategy:</strong> Avoid or eliminate mutants by outsmarting them, not just fighting head-on.</li>\n      <li><strong>Explore the Lab:</strong> Uncover logs, secrets, and the truth behind the parasite outbreak.</li>\n    </ul>\n\n    <h2 class=\"H22\">Why Play Endoparasitic Unblocked?</h2>\n    <p><strong>Endoparasitic Unblocked</strong> is brutally immersive. The one-arm mechanic forces you to think tactically, plan ahead, and manage every second. It's a fresh take on survival horror with an unforgettable atmosphere and tension.</p>\n\n    <h2 class=\"H22\">Key Features</h2>\n    <ul>\n      <li><strong>One-Arm Gameplay:</strong> Reload, inject, and fight with true manual control.</li>\n      <li><strong>Constant Pressure:</strong> The parasite drains health over time, pushing urgency into every moment.</li>\n      <li><strong>Terrifying Mutants:</strong> Face unpredictable and deadly creatures throughout the lab.</li>\n      <li><strong>Resource Management:</strong> Vaccines, ammo, and tools are scarce—use them wisely.</li>\n      <li><strong>Deep Atmosphere:</strong> Dark corridors, eerie audio, and strong tension throughout.</li>\n    </ul>\n\n    <h2 class=\"H22\">Can You Survive the Parasite?</h2>\n    <p>With limited resources, one arm, and an evolving infection, you must outsmart everything the lab throws at you. Will you complete your research and escape alive in <strong>Endoparasitic Unblocked</strong>?</p>\n\n    <script type=\"application/ld+json\">\n    {\n      \"@context\": \"https://schema.org\",\n      \"@type\": \"FAQPage\",\n      \"mainEntity\": [\n        {\n          \"@type\": \"Question\",\n          \"name\": \"What is Endoparasitic Unblocked?\",\n          \"acceptedAnswer\": {\n            \"@type\": \"Answer\",\n            \"text\": \"Endoparasitic Unblocked is a tactical survival horror game where you survive with one arm while battling mutants and managing a parasite infection.\"\n          }\n        },\n        {\n          \"@type\": \"Question\",\n          \"name\": \"How do you play Endoparasitic Unblocked?\",\n          \"acceptedAnswer\": {\n            \"@type\": \"Answer\",\n            \"text\": \"Players manually reload, fight mutants, inject vaccines, and solve puzzles while navigating a dangerous research lab.\"\n          }\n        },\n        {\n          \"@type\": \"Question\",\n          \"name\": \"What makes Endoparasitic Unblocked unique?\",\n          \"acceptedAnswer\": {\n            \"@type\": \"Answer\",\n            \"text\": \"Its one-arm mechanic requires players to manually perform every action, creating high tension and strategic gameplay.\"\n          }\n        },\n        {\n          \"@type\": \"Question\",\n          \"name\": \"Is Endoparasitic Unblocked a horror game?\",\n          \"acceptedAnswer\": {\n            \"@type\": \"Answer\",\n            \"text\": \"Yes, it is a survival horror game with constant pressure from mutants and a draining parasite infection.\"\n          }\n        }\n      ]\n    }\n    </script>\n  ","tag":["Endoparasitic Unblocked","Horror","Survival","Parasite","Lab","Mutants","Strategy","Tactical","Thriller","Indie","Free Online Game"],"rating":[4.8,6320,301]}},"__N_SSG":true}