{"pageProps":{"game":{"date":"29-10-2025","brand":"Poor Bunny","orientation":0,"title":"Poor Bunny Unblocked – Play Free Arcade Bunny Game Online","name":["Poor Bunny","poor-bunny"],"thumb":"/assets/thumb/poor-bunny.png","thumb_big":"/assets/thumb/poor-bunny.png","path":["/game/poor-bunny","https://newunblockedgames.gitlab.io"],"iframe":"https://smash-kartsonline.github.io/g2/class-548/","Walkthrough":"https://www.youtube.com/embed/","s_dis":"Play Poor Bunny Unblocked online for free! Collect carrots, dodge traps, and unlock cute bunnies in solo or multiplayer modes.","l_dis":"\n    <h1>Poor Bunny Unblocked – Collect Carrots and Dodge Traps Online</h1>\n    <p><strong>Poor Bunny Unblocked</strong> is a fast-paced arcade game where you control a cute bunny racing to eat as many carrots as possible while dodging deadly traps. Featuring solo, co-op, and versus modes, this addictive platformer is perfect for casual fun or competitive play.</p>\n\n    <h2 class=\"H22\">What is Poor Bunny Unblocked?</h2>\n    <p><strong>Poor Bunny Unblocked</strong> challenges you to survive in a trap-filled arena while collecting carrots to earn points. The randomness of traps like spikes, lasers, and falling objects makes every round chaotic and hilarious. Easy to learn but tough to master, it’s a true test of timing and agility.</p>\n\n    <h2 class=\"H22\">How to Play Poor Bunny Unblocked?</h2>\n    <ul>\n      <li><strong>Choose Your Bunny:</strong> Pick from adorable characters.</li>\n      <li><strong>Move and Dodge:</strong> Use arrow keys or on-screen controls to avoid traps.</li>\n      <li><strong>Collect Carrots:</strong> Score points by grabbing as many carrots as possible.</li>\n      <li><strong>Survive the Chaos:</strong> Watch out for spikes, lasers, and falling hazards.</li>\n      <li><strong>Unlock New Bunnies:</strong> Earn rewards and expand your collection.</li>\n    </ul>\n\n    <h2 class=\"H22\">Game Features</h2>\n    <ul>\n      <li><strong>Multiple Modes:</strong> Play solo, co-op, or versus friends.</li>\n      <li><strong>100+ Unlockable Bunnies:</strong> Collect new characters as you progress.</li>\n      <li><strong>Simple Yet Addictive:</strong> One-button gameplay that’s easy to learn but hard to put down.</li>\n      <li><strong>Cross-Platform:</strong> Available on PC, mobile, and tablets.</li>\n      <li><strong>High-Score Challenge:</strong> Compete for the best score in every session.</li>\n    </ul>\n\n    <h2 class=\"H22\">Why Play Poor Bunny Unblocked?</h2>\n    <p><strong>Poor Bunny Unblocked</strong> lets you enjoy the game anywhere without restrictions. No downloads or installations—just instant access to chaotic arcade fun at school, work, or home.</p>\n\n    <h2 class=\"H22\">Jump Into the Fun!</h2>\n    <p>Start hopping, dodging, and collecting carrots today in <strong>Poor Bunny Unblocked</strong> — the ultimate bunny arcade adventure!</p>\n\n    <script type=\"application/ld+json\">\n    {\n      \"@context\": \"https://schema.org\",\n      \"@type\": \"FAQPage\",\n      \"mainEntity\": [\n        {\n          \"@type\": \"Question\",\n          \"name\": \"What is Poor Bunny Unblocked?\",\n          \"acceptedAnswer\": {\n            \"@type\": \"Answer\",\n            \"text\": \"Poor Bunny Unblocked is a free arcade game where players collect carrots and avoid traps in solo or multiplayer modes.\"\n          }\n        },\n        {\n          \"@type\": \"Question\",\n          \"name\": \"How do you play Poor Bunny Unblocked?\",\n          \"acceptedAnswer\": {\n            \"@type\": \"Answer\",\n            \"text\": \"Move your bunny to collect carrots while dodging traps. Survive as long as possible to score points.\"\n          }\n        },\n        {\n          \"@type\": \"Question\",\n          \"name\": \"Can you play Poor Bunny Unblocked with friends?\",\n          \"acceptedAnswer\": {\n            \"@type\": \"Answer\",\n            \"text\": \"Yes! Poor Bunny Unblocked supports co-op and versus multiplayer modes for fun with friends.\"\n          }\n        },\n        {\n          \"@type\": \"Question\",\n          \"name\": \"Is Poor Bunny Unblocked free?\",\n          \"acceptedAnswer\": {\n            \"@type\": \"Answer\",\n            \"text\": \"Yes, Poor Bunny Unblocked is completely free to play online with no download required.\"\n          }\n        }\n      ]\n    }\n    </script>\n  ","tag":["Arcade","Multiplayer","Bunny","Animals","Collecting","Platformer","Free Online Game"],"rating":[4.7,1780,94]}},"__N_SSG":true}