{"pageProps":{"game":{"date":"19-11-2025","brand":"Tomb of the Mask","orientation":0,"title":"Tomb of the Mask – Retro Arcade Maze Challenge","name":["Tomb of the Mask","tomb-of-the-mask"],"thumb":"/assets/thumb/tomb-of-the-mask.png","thumb_big":"/assets/thumb/tomb-of-the-mask.png","path":["/game/tomb-of-the-mask","https://newunblockedgames.gitlab.io"],"iframe":"https://genizymath.github.io/iframe/109.html","Walkthrough":"https://www.youtube.com/embed/","s_dis":"Tomb of the Mask is a retro-style arcade game with vertical, endless mazes. Use a mask to climb walls, avoid lava and hazards, collect items, and use power-ups to survive in a fast-paced pixel-art environment.","l_dis":"<h1>Play Tomb of the Mask – Retro Arcade Maze Challenge</h1>\n  <p><strong>Tomb of the Mask – Unblocked</strong> is a retro-style arcade game where players navigate endless vertical mazes. Climb walls using your mask, avoid traps, and escape rising lava while collecting items and power-ups.</p>\n\n  <h2 class=\"H22\">What is Tomb of the Mask?</h2>\n  <p><strong>Tomb of the Mask – Unblocked</strong> combines fast reflexes and classic arcade action. Players must quickly react to traps, enemies, and environmental hazards while climbing walls and progressing through endless pixel-art mazes.</p>\n\n  <h2 class=\"H22\">How to Play Tomb of the Mask</h2>\n  <ul>\n    <li><strong>Climb Walls:</strong> Navigate vertical mazes by climbing walls using the mask.</li>\n    <li><strong>Avoid Hazards:</strong> Dodge rising lava, traps, and enemies to survive.</li>\n    <li><strong>Collect Items:</strong> Gather coins and power-ups to enhance gameplay.</li>\n    <li><strong>Use Power-Ups:</strong> Activate abilities to temporarily avoid danger or gain advantages.</li>\n    <li><strong>Focus on Reflexes:</strong> Quick thinking and fast reactions are key to progressing.</li>\n  </ul>\n\n  <h2 class=\"H22\">Why Play Tomb of the Mask?</h2>\n  <p>With its retro pixel-art style, fast-paced arcade gameplay, and challenging endless mazes, <strong>Tomb of the Mask</strong> is perfect for players seeking quick reflex challenges and nostalgic arcade fun.</p>\n\n  <h2 class=\"H22\">Key Features</h2>\n  <ul>\n    <li><strong>Endless Vertical Mazes:</strong> Navigate continuously challenging levels.</li>\n    <li><strong>Retro Pixel Art:</strong> Classic arcade-style graphics and animations.</li>\n    <li><strong>Fast-Paced Gameplay:</strong> Focus on reflexes to survive hazards and enemies.</li>\n    <li><strong>Collectibles & Power-Ups:</strong> Enhance gameplay and improve chances of survival.</li>\n    <li><strong>Challenge Mode:</strong> Endless action for replayability and skill mastery.</li>\n  </ul>\n\n  <h2 class=\"H22\">Escape the Tomb</h2>\n  <p>Test your reflexes and climb to safety in <strong>Tomb of the Mask</strong>, the ultimate retro arcade maze adventure!</p>\n\n  <script type=\"application/ld+json\">\n  {\n    \"@context\": \"https://schema.org\",\n    \"@type\": \"FAQPage\",\n    \"mainEntity\": [\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What is Tomb of the Mask?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Tomb of the Mask is a retro-style arcade game where players climb walls in endless vertical mazes while avoiding hazards and collecting power-ups.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"How do you survive in Tomb of the Mask?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Players must avoid traps, enemies, and rising lava, using quick reflexes and strategic use of power-ups.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Are there power-ups in Tomb of the Mask?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes. Power-ups can help players avoid danger or gain temporary advantages in the maze.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Is Tomb of the Mask a retro game?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes. It features pixel-art graphics and classic arcade-style gameplay reminiscent of retro games.\"\n        }\n      }\n    ]\n  }\n  </script>\n  ","tag":["Tomb of the Mask","Arcade","Maze","Pixel Art","Reflex","Endless","Power-Ups","Retro Game","Challenges","Casual","Fast-Paced"],"rating":[4.6,430,25]}},"__N_SSG":true}