{"pageProps":{"game":{"date":"19-11-2025","brand":"Candy Crush","orientation":0,"title":"Candy Crush Unblocked – Play Free Match-Three Puzzle Game Online","name":["Candy Crush","candy-crush"],"thumb":"/assets/thumb/candy-crush.png","thumb_big":"/assets/thumb/candy-crush.png","path":["/game/candy-crush","https://newunblockedgames.gitlab.io"],"iframe":"https://genizymath.github.io/iframe/171.html","Walkthrough":"https://www.youtube.com/embed/","s_dis":"Play Candy Crush Unblocked, the world-famous match-three puzzle game where you swap candies, trigger combos, complete objectives, and progress through thousands of sweet levels.","l_dis":"\n    <h1>Candy Crush Unblocked – The Iconic Match-Three Puzzle Game</h1>\n    <p><strong>Candy Crush Unblocked</strong> is one of the most popular match-three puzzle games ever created. Players swap colorful candies to create matching combinations, clear objectives, and advance through thousands of sweet, challenging levels.</p>\n\n    <h2 class=\"H22\">What Is Candy Crush Unblocked?</h2>\n    <p><strong>Candy Crush Unblocked</strong> is a puzzle game where players match at least three candies of the same color to clear them from the board. Each level provides unique challenges, such as clearing jelly, dropping ingredients to the bottom, or reaching a specific score within a limited number of moves.</p>\n\n    <h2 class=\"H22\">How to Play Candy Crush Unblocked?</h2>\n    <ul>\n      <li><strong>Match Candies:</strong> Swap adjacent candies to create matching groups of three or more.</li>\n      <li><strong>Create Special Candies:</strong> Match four or more candies to generate powerful boosters like striped candies, wrapped candies, and color bombs.</li>\n      <li><strong>Complete Objectives:</strong> Each level has its own goal—clear jelly, drop ingredients, or hit a score target.</li>\n      <li><strong>Limited Moves:</strong> Solve the puzzle with the moves given. Plan ahead and make strategic choices.</li>\n      <li><strong>Advance Through Levels:</strong> Complete stages to unlock new worlds and challenges.</li>\n    </ul>\n\n    <h2 class=\"H22\">Key Features</h2>\n    <ul>\n      <li><strong>Match-Three Puzzle Fun:</strong> Simple mechanics with strategic depth.</li>\n      <li><strong>Special Candies:</strong> Create combos and chain reactions for huge scores.</li>\n      <li><strong>Thousands of Levels:</strong> Continually updated with new challenges.</li>\n      <li><strong>Colorful, Sweet Aesthetic:</strong> Bright visuals and satisfying effects.</li>\n      <li><strong>Accessible Gameplay:</strong> Easy for beginners, challenging for puzzle fans.</li>\n    </ul>\n\n    <h2 class=\"H22\">Why Play Candy Crush Unblocked?</h2>\n    <p><strong>Candy Crush Unblocked</strong> offers addicting gameplay, satisfying matches, and nearly endless levels. Perfect for casual players and puzzle lovers alike, every level brings new challenges and sweet rewards.</p>\n\n    <h2 class=\"H22\">Sweeten Your Strategy</h2>\n    <p>Think ahead, create big combos, and blast through candy-filled challenges. How far can you go on the <strong>Candy Crush Unblocked</strong> map?</p>\n\n    <script type=\"application/ld+json\">\n    {\n      \"@context\": \"https://schema.org\",\n      \"@type\": \"FAQPage\",\n      \"mainEntity\": [\n        {\n          \"@type\": \"Question\",\n          \"name\": \"What is Candy Crush Unblocked?\",\n          \"acceptedAnswer\": {\n            \"@type\": \"Answer\",\n            \"text\": \"Candy Crush Unblocked is a match-three puzzle game where players swap candies to create combinations, complete objectives, and progress through levels.\"\n          }\n        },\n        {\n          \"@type\": \"Question\",\n          \"name\": \"How do you play Candy Crush Unblocked?\",\n          \"acceptedAnswer\": {\n            \"@type\": \"Answer\",\n            \"text\": \"Players match candies, create special candy power-ups, and complete level-specific goals using a limited number of moves.\"\n          }\n        },\n        {\n          \"@type\": \"Question\",\n          \"name\": \"How many levels are in Candy Crush Unblocked?\",\n          \"acceptedAnswer\": {\n            \"@type\": \"Answer\",\n            \"text\": \"Candy Crush Unblocked has thousands of levels, with new ones added regularly.\"\n          }\n        },\n        {\n          \"@type\": \"Question\",\n          \"name\": \"Is Candy Crush Unblocked easy to play?\",\n          \"acceptedAnswer\": {\n            \"@type\": \"Answer\",\n            \"text\": \"Yes, Candy Crush Unblocked is easy for beginners but becomes progressively challenging, appealing to both casual and experienced puzzle players.\"\n          }\n        }\n      ]\n    }\n    </script>\n  ","tag":["Puzzle","Match Three","Casual","Strategy","Mobile","Colorful","Addictive","Classic","Free Online Game"],"rating":[4.8,9820,441]}},"__N_SSG":true}