{"pageProps":{"game":{"date":"19-11-2025","brand":"Mortal Kombat","orientation":0,"title":"Mortal Kombat Unblocked – Play Free Classic Fighting Game Online","name":["Mortal Kombat","mortal-kombat"],"thumb":"/assets/thumb/mortal-kombat.png","thumb_big":"/assets/thumb/mortal-kombat.png","path":["/game/mortal-kombat","https://newunblockedgames.gitlab.io"],"iframe":"https://dondido.github.io/flash-store/s/mortal_kombat_karnage/#play","Walkthrough":"https://www.youtube.com/embed/","s_dis":"Play Mortal Kombat Unblocked, the legendary fighting game franchise known for brutal combat, iconic characters, and unforgettable Fatalities in a free browser version.","l_dis":"\n    <h1>Mortal Kombat Unblocked – The Iconic Brutal Fighting Game</h1>\n    <p><strong>Mortal Kombat Unblocked</strong> is one of the most iconic fighting game franchises ever created, famous for its intense martial arts battles, unforgettable characters, and extreme, graphic finishers known as Fatalities. This classic browser version captures the brutal spirit of the original games, offering fast-paced, skill-based combat right at your fingertips.</p>\n\n    <h2 class=\"H22\">What Is Mortal Kombat Unblocked?</h2>\n    <p><strong>Mortal Kombat Unblocked</strong> is a competitive fighting game where players choose from a roster of unique warriors—each with their own fighting style, lore, and special moves. The series became famous for its over-the-top violence, spine-crushing combos, and iconic characters such as Scorpion, Sub-Zero, Liu Kang, and Raiden.</p>\n\n    <h2 class=\"H22\">How to Play Mortal Kombat Unblocked?</h2>\n    <ul>\n      <li><strong>Choose Your Fighter:</strong> Select from classic Mortal Kombat characters, each offering a different playstyle.</li>\n      <li><strong>Master Special Moves:</strong> Learn key combinations to execute powerful attacks and combos.</li>\n      <li><strong>Fight to the Finish:</strong> Reduce your opponent’s health to zero.</li>\n      <li><strong>Execute a Fatality:</strong> At the end of a match, use a special input to perform a brutal finishing move.</li>\n      <li><strong>Progress Through Opponents:</strong> Fight your way through increasingly difficult enemies to become the champion.</li>\n    </ul>\n\n    <h2 class=\"H22\">Key Features</h2>\n    <ul>\n      <li><strong>Classic MK Gameplay:</strong> Fast, responsive, and intense combat.</li>\n      <li><strong>Iconic Fatalities:</strong> Finish your opponent with graphic execution moves.</li>\n      <li><strong>Legendary Characters:</strong> Play as fan favorites from the Mortal Kombat universe.</li>\n      <li><strong>Retro Visuals:</strong> Old-school graphics that bring back the nostalgia of classic MK titles.</li>\n      <li><strong>Browser Ready:</strong> Jump into the action instantly with no downloads required.</li>\n    </ul>\n\n    <h2 class=\"H22\">Why Play Mortal Kombat Unblocked Online?</h2>\n    <p><strong>Mortal Kombat Unblocked</strong> lets players experience the excitement and brutality of classic Mortal Kombat directly in their browser. Whether you're revisiting childhood memories or exploring the franchise for the first time, the game delivers nonstop action, strategic combat, and unforgettable finishing moves.</p>\n\n    <script type=\"application/ld+json\">\n    {\n      \"@context\": \"https://schema.org\",\n      \"@type\": \"FAQPage\",\n      \"mainEntity\": [\n        {\n          \"@type\": \"Question\",\n          \"name\": \"What is Mortal Kombat Unblocked?\",\n          \"acceptedAnswer\": {\n            \"@type\": \"Answer\",\n            \"text\": \"Mortal Kombat Unblocked is a legendary fighting game franchise known for its intense martial arts combat, unique characters, and graphic finishing moves called Fatalities.\"\n          }\n        },\n        {\n          \"@type\": \"Question\",\n          \"name\": \"Is this the original Mortal Kombat?\",\n          \"acceptedAnswer\": {\n            \"@type\": \"Answer\",\n            \"text\": \"This is a browser-playable version inspired by classic Mortal Kombat gameplay, offering similar characters and mechanics.\"\n          }\n        },\n        {\n          \"@type\": \"Question\",\n          \"name\": \"How do you play Mortal Kombat Unblocked?\",\n          \"acceptedAnswer\": {\n            \"@type\": \"Answer\",\n            \"text\": \"Choose a fighter, master special moves, defeat your opponent, and perform a Fatality to finish the match.\"\n          }\n        },\n        {\n          \"@type\": \"Question\",\n          \"name\": \"Why is Mortal Kombat Unblocked so popular?\",\n          \"acceptedAnswer\": {\n            \"@type\": \"Answer\",\n            \"text\": \"Its intense combat, memorable characters, and iconic Fatalities have made it one of the most influential fighting game series in history.\"\n          }\n        }\n      ]\n    }\n    </script>\n  ","tag":["Mortal Kombat Unblocked","Fighting","Arcade","Action","Retro","Fatalities","Martial Arts","Classic","Combat","Brutal","Free Online Game"],"rating":[4.8,6590,402]}},"__N_SSG":true}