{"pageProps":{"game":{"date":"24-09-2025","brand":"Subway Surfers","orientation":0,"title":"Subway Surfers: St. Petersburg Unblocked Online","name":["Subway Surfers: St. Petersburg","subway-surfers-stpetersburg"],"thumb":"/assets/thumb/subway-surfers-stpetersburg.png","thumb_big":"/assets/thumb/subway-surfers-stpetersburg.png","path":["/game/subway-surfers-stpetersburg","https://newunblockedgames.gitlab.io"],"iframe":"https://genizymath.github.io/iframe/139.html","Walkthrough":"https://www.youtube.com/embed/","s_dis":"Subway Surfers: St. Petersburg brings players to snowy Russia, playable online unblocked with winter-themed characters, boards, and festive collectibles like snowflakes.","l_dis":"<h1>Subway Surfers: St. Petersburg – Dash Through the Snowy Streets of Russia</h1>\n  <p><strong>Subway Surfers: St. Petersburg</strong> immerses players in the wintery streets of St. Petersburg. Run, jump, and slide along snowy tracks, dodging trains, barriers, and collecting coins, snowflakes, and power-ups.</p>\n\n  <h2 class=\"H22\">What is Subway Surfers: St. Petersburg?</h2>\n  <p>This seasonal World Tour edition features St. Petersburg’s snowy streets, festive decorations, Russian folk music, and winter-themed characters and boards. Collect snowflakes during Weekly Hunts for special rewards.</p>\n\n  <h2 class=\"H22\">How to Play Subway Surfers: St. Petersburg?</h2>\n  <ul>\n    <li><strong>Swipe Controls:</strong> Swipe up to jump, down to roll, left/right to switch lanes.</li>\n    <li><strong>Collect Coins & Snowflakes:</strong> Gather coins, snowflakes, and other items to unlock Weekly Hunt rewards like hoverboards and keys.</li>\n    <li><strong>Dodge Obstacles:</strong> Avoid trains, icy barriers, and winter-themed hazards while maintaining your run.</li>\n    <li><strong>Use Power-Ups:</strong> Activate magnets, jetpacks, and hoverboards to extend your run and maximize your score.</li>\n  </ul>\n\n  <h2 class=\"H22\">Why Play Subway Surfers: St. Petersburg Unblocked?</h2>\n  <p>Experience the snowy, festive streets of Russia in <strong>Subway Surfers: St. Petersburg</strong> online without restrictions, unlock new characters, boards, and seasonal collectibles.</p>\n\n  <h2 class=\"H22\">Key Features</h2>\n  <ul>\n    <li><strong>St. Petersburg Environment:</strong> Explore snow-covered streets, holiday decorations, and scenic Russian landmarks.</li>\n    <li><strong>Exclusive Characters & Boards:</strong> Unlock festive characters and winter-themed boards.</li>\n    <li><strong>Endless Runner Gameplay:</strong> Classic swipe-based controls with a snowy, festive twist.</li>\n    <li><strong>Special Collectibles:</strong> Collect snowflakes for Weekly Hunt rewards.</li>\n    <li><strong>Unblocked Online:</strong> Play instantly in your browser anywhere.</li>\n  </ul>\n\n  <h2 class=\"H22\">Master St. Petersburg's Subway Tracks!</h2>\n  <p>Run, jump, and slide through <strong>Subway Surfers: St. Petersburg</strong> to beat obstacles, collect rewards, and enjoy the festive winter environment!</p>\n\n  <script type=\"application/ld+json\">\n  {\n    \"@context\": \"https://schema.org\",\n    \"@type\": \"FAQPage\",\n    \"mainEntity\": [\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What is Subway Surfers: St. Petersburg?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"It is a winter-themed edition of Subway Surfers set in St. Petersburg, Russia, with festive characters, boards, and collectibles like snowflakes.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"How do you play Subway Surfers: St. Petersburg?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Swipe to jump, roll, and switch lanes while collecting coins, snowflakes, and using power-ups to survive as long as possible.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Is Subway Surfers: St. Petersburg unblocked?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes, this edition is playable online without restrictions.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Who are the characters in St. Petersburg?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Players can unlock winter-themed characters specific to this edition.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What are the special collectibles in St. Petersburg?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Players collect snowflakes for Weekly Hunt rewards like hoverboards and keys.\"\n        }\n      }\n    ]\n  }\n  </script>\n  ","tag":["Subway Surfers","Endless Runner","St. Petersburg","Russia","Unblocked","Winter"],"rating":[4.8,5321,478]}},"__N_SSG":true}