{"pageProps":{"game":{"date":"29-10-2025","brand":"R.E.P.O","orientation":1,"title":"R.E.P.O – Online Co-op Horror Extraction Game","name":["R.E.P.O","repo"],"thumb":"/assets/thumb/repo.png","thumb_big":"/assets/thumb/repo.png","path":["/game/repo","https://newunblockedgames.gitlab.io"],"iframe":"https://genizymath.github.io/iframe/195.html","Walkthrough":"https://www.youtube.com/embed/","s_dis":"R.E.P.O is a co-op horror extraction game where up to six players work as robots collecting valuable items while surviving monsters and hazards.","l_dis":"<h1>Play R.E.P.O – Online Co-op Horror Extraction Game</h1>\n  <p><strong>R.E.P.O – Unblocked</strong> is a tense, cooperative horror experience where up to six players take on the role of robotic workers collecting valuable salvage for their employer, the <strong>Taxman</strong>. Combining teamwork, physics-based gameplay, and terrifying encounters, R.E.P.O challenges you to extract high-value items without getting destroyed by lurking horrors.</p>\n\n  <h2 class=\"H22\">What is R.E.P.O?</h2>\n  <p><strong>R.E.P.O</strong> stands for “Recovery Extraction Protocol Operators.” Players are tasked with entering abandoned industrial zones, derelict facilities, and other hazardous locations to collect and safely extract valuable items. Every mission is different thanks to randomized layouts and unpredictable threats. Communication and precision are key to survival.</p>\n\n  <h2 class=\"H22\">How to Play R.E.P.O</h2>\n  <ul>\n    <li><strong>Work Together:</strong> Join up to five other players to recover and transport fragile or heavy items.</li>\n    <li><strong>Use Proximity Chat:</strong> Communicate with your teammates through in-game voice chat for realistic coordination.</li>\n    <li><strong>Avoid Monsters:</strong> Stay quiet and use strategy to evade terrifying creatures that stalk the area.</li>\n    <li><strong>Manage Physics:</strong> Handle objects carefully—dropping or damaging them lowers their value.</li>\n    <li><strong>Extract Safely:</strong> Deliver the items to extraction points to earn <strong>SURPLUS</strong> currency for upgrades.</li>\n  </ul>\n\n  <h2 class=\"H22\">Why Play R.E.P.O?</h2>\n  <p><strong>R.E.P.O</strong> blends the intensity of horror survival with the teamwork of co-op extraction games like <em>Lethal Company</em> or <em>Phasmophobia</em>. Every session feels unique, with randomized maps, unpredictable enemies, and tense moments that test your teamwork and composure.</p>\n\n  <h2 class=\"H22\">Key Features</h2>\n  <ul>\n    <li><strong>Co-op Gameplay:</strong> Play with up to six friends using proximity chat.</li>\n    <li><strong>Physics-Based Items:</strong> Carefully carry and transport objects without damaging them.</li>\n    <li><strong>Roguelike Elements:</strong> Randomized missions and environments ensure replayability.</li>\n    <li><strong>Upgrade System:</strong> Use SURPLUS currency to buy weapons, tools, and permanent upgrades.</li>\n    <li><strong>Immersive Horror:</strong> Face eerie sound design, dynamic lighting, and unpredictable threats.</li>\n  </ul>\n\n  <h2 class=\"H22\">Enter the Extraction Zone</h2>\n  <p>Gather your crew and step into the unsettling world of <strong>R.E.P.O</strong>. Can you recover the goods, survive the monsters, and make it out alive? Your employer is waiting… and the Taxman always collects.</p>\n\n  <script type=\"application/ld+json\">\n  {\n    \"@context\": \"https://schema.org\",\n    \"@type\": \"FAQPage\",\n    \"mainEntity\": [\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What is R.E.P.O?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"R.E.P.O is a cooperative online horror game where players act as robot workers collecting valuable items in dangerous environments while avoiding monsters.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"How many players can play R.E.P.O?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Up to six players can join a co-op session in R.E.P.O, working together to extract valuable salvage.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What is SURPLUS in R.E.P.O?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"SURPLUS is the in-game currency earned from successful extractions and used to buy upgrades and equipment at the Service Station.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Is R.E.P.O similar to Lethal Company?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes, R.E.P.O shares similarities with Lethal Company, featuring co-op extraction gameplay, proximity chat, and horror elements, but with its own physics-based and robotic twist.\"\n        }\n      }\n    ]\n  }\n  </script>\n  ","tag":["R.E.P.O","Horror","Co-op","Extraction","Survival","Multiplayer","Roguelike","Robots","Voice Chat","Unblocked"],"rating":[4.9,2080,169]}},"__N_SSG":true}