{"pageProps":{"game":{"date":"08-09-2025","brand":"Github","orientation":1,"title":"PAC-MAN Unblocked Classic Arcade Game","name":["PAC-MAN","pac-man"],"thumb":"/assets/thumb/pac-man.png","thumb_big":"/assets/thumb/pac-man.png","path":["/game/pac-man","https://newunblockedgames.gitlab.io"],"iframe":"https://masonicgit.github.io/pacman/","Walkthrough":"https://www.youtube.com/embed/","s_dis":"PAC-MAN is the legendary 1980 arcade maze chase game where you eat dots, dodge ghosts, and chomp power pellets to turn the tables.","l_dis":" <h1>PAC-MAN – The Timeless Arcade Classic Unblocked</h1>\n  <p><strong>PAC-MAN</strong> is one of the most iconic video games of all time, originally released by <strong>Namco in 1980</strong>. In this unblocked version, you guide the yellow hero through mazes filled with dots, avoiding the four famous ghosts—<strong>Blinky, Pinky, Inky, and Clyde</strong>. Your mission: eat every dot, score bonus fruit, and survive as long as possible.</p>\n  <h2 class=\"H22\">What is PAC-MAN?</h2>\n  <p><strong>PAC-MAN</strong> is an <strong>action maze chase game</strong> where you clear levels by eating all the dots while avoiding deadly ghosts. By grabbing <strong>power pellets</strong>, you can flip the chase, turning ghosts blue and eating them for extra points. It’s simple, addictive, and endlessly replayable—one of the most recognizable games in history.</p>\n  <h2 class=\"H22\">How to Play PAC-MAN?</h2>\n  <ul>\n    <li><strong>Move Pac-Man:</strong> Use arrow keys to navigate the maze.</li>\n    <li><strong>Eat Dots:</strong> Clear all the small pellets to complete each level.</li>\n    <li><strong>Avoid Ghosts:</strong> Blinky, Pinky, Inky, and Clyde will chase you relentlessly.</li>\n    <li><strong>Use Power Pellets:</strong> Eat them to turn ghosts blue and chomp them for bonus points.</li>\n    <li><strong>Score Big:</strong> Eat fruit and ghosts to rack up extra points.</li>\n  </ul>\n  <h2 class=\"H22\">Why Play PAC-MAN Unblocked?</h2>\n  <p><strong>PAC-MAN Unblocked</strong> lets you enjoy the timeless arcade classic anytime, anywhere—school, work, or home. No quarters, no cabinet, just pure <strong>retro fun</strong> in your browser.</p>\n  <h2 class=\"H22\">Key Features</h2>\n  <ul>\n    <li><strong>Classic Maze Chase Gameplay:</strong> Pure arcade fun from the golden era.</li>\n    <li><strong>Power Pellet Mechanics:</strong> Turn the tables on ghosts for a thrilling reversal.</li>\n    <li><strong>Ghost AI Personalities:</strong> Each ghost has its own chase pattern and behavior.</li>\n    <li><strong>Endless Challenge:</strong> Levels keep looping with increasing speed and difficulty.</li>\n    <li><strong>Unblocked Access:</strong> Play instantly online without restrictions or downloads.</li>\n  </ul>\n  <h2 class=\"H22\">Can You Outsmart the Ghosts?</h2>\n  <p><strong>PAC-MAN</strong> is more than a game—it’s a test of <strong>reflexes, memory, and strategy</strong>. Learn the ghosts’ patterns, master the mazes, and see how far you can go. 👻🍒</p>\n  <p>The chase never ends—<strong>are you ready to keep running?</strong></p>\n  <script type=\"application/ld+json\">\n  {\n    \"@context\": \"https://schema.org\",\n    \"@type\": \"FAQPage\",\n    \"mainEntity\": [\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What is PAC-MAN?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"PAC-MAN is a 1980 arcade game by Namco where players eat dots in a maze while avoiding four ghosts, using power pellets to temporarily turn the tables.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"How do you play PAC-MAN?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Players move Pac-Man through the maze with arrow keys, eat all the dots to finish a level, and avoid being caught by the ghosts unless a power pellet is active.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Who are the ghosts in PAC-MAN?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"The four ghosts are Blinky, Pinky, Inky, and Clyde—each with unique movement patterns designed to corner Pac-Man.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Why play PAC-MAN unblocked?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"The unblocked version allows players to enjoy PAC-MAN online without restrictions, instantly accessible at school, work, or home.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Is PAC-MAN endless?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes, PAC-MAN continues with increasingly harder levels until all player lives are lost.\"\n        }\n      }\n    ]\n  }\n  </script>\n  ","tag":["Arcade","Classic","Retro","Maze","Unblocked"],"rating":[4.9,30122,2841]}},"__N_SSG":true}