{"pageProps":{"game":{"date":"19-11-2025","brand":"Cluster Rush","orientation":0,"title":"Cluster Rush – Chaotic Platformer on Speeding Trucks","name":["Cluster Rush","cluster-rush"],"thumb":"/assets/thumb/cluster-rush.png","thumb_big":"/assets/thumb/cluster-rush.png","path":["/game/cluster-rush","https://newunblockedgames.gitlab.io"],"iframe":"https://ubgwtf.gitlab.io/cluster-rush/","Walkthrough":"https://www.youtube.com/embed/","s_dis":"Cluster Rush, also known as Clustertruck, is a chaotic platformer where players jump between speeding trucks, avoid obstacles, and reach the end of levels without falling or getting crushed. Reflexes, timing, and acrobatics are key.","l_dis":"<h1>Play Cluster Rush – Chaotic Platformer on Speeding Trucks</h1>\n  <p><strong>Cluster Rush – Unblocked</strong> is an action-packed platformer where players navigate levels by jumping between speeding trucks. Dodge obstacles, avoid falling, and reach the finish line in this thrilling 'floor is lava' style game.</p>\n\n  <h2 class=\"H22\">What is Cluster Rush?</h2>\n  <p><strong>Cluster Rush – Unblocked</strong> is a high-speed platformer where players must rely on reflexes and timing to jump across moving trucks, dodge hazards like spinning platforms and lasers, and complete challenging levels.</p>\n\n  <h2 class=\"H22\">How to Play Cluster Rush</h2>\n  <ul>\n    <li><strong>Jump Between Trucks:</strong> Navigate moving platforms to progress through each level.</li>\n    <li><strong>Avoid Hazards:</strong> Watch out for lasers, spinning trucks, and other obstacles.</li>\n    <li><strong>Stay Off the Ground:</strong> Falling ends the level, so keep moving and jumping carefully.</li>\n    <li><strong>Use Acrobatics:</strong> Timing and reflexes are key to surviving longer levels.</li>\n    <li><strong>Reach the Finish Line:</strong> Complete each level as quickly and safely as possible.</li>\n  </ul>\n\n  <h2 class=\"H22\">Why Play Cluster Rush?</h2>\n  <p>With chaotic gameplay, fast-paced action, and unique 'floor is lava' mechanics, <strong>Cluster Rush</strong> is perfect for fans of reflex-based platformers and thrill-seeking gamers.</p>\n\n  <h2 class=\"H22\">Key Features</h2>\n  <ul>\n    <li><strong>Chaotic Platforming:</strong> Jump across fast-moving trucks in thrilling levels.</li>\n    <li><strong>Reflex-Based Gameplay:</strong> Quick thinking and timing are essential.</li>\n    <li><strong>Challenging Obstacles:</strong> Lasers, spinning platforms, and moving hazards.</li>\n    <li><strong>Fast-Paced Action:</strong> Levels designed for adrenaline-filled gameplay.</li>\n    <li><strong>Floor is Lava Style:</strong> Touching the ground ends the level, keeping players on their toes.</li>\n  </ul>\n\n  <h2 class=\"H22\">Survive the Chaos</h2>\n  <p>Test your reflexes and acrobatics in <strong>Cluster Rush</strong>, the ultimate chaotic platformer on speeding trucks!</p>\n\n  <script type=\"application/ld+json\">\n  {\n    \"@context\": \"https://schema.org\",\n    \"@type\": \"FAQPage\",\n    \"mainEntity\": [\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What is Cluster Rush?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Cluster Rush is a chaotic platformer where players jump between speeding trucks, avoid obstacles, and aim to complete levels without falling.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"How do you avoid falling in Cluster Rush?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Players must jump accurately between moving trucks and avoid obstacles to stay off the ground.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Does Cluster Rush include hazards?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes. Obstacles include spinning trucks, lasers, and moving platforms.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What skills are needed for Cluster Rush?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Reflexes, timing, and acrobatics are key to navigating chaotic levels successfully.\"\n        }\n      }\n    ]\n  }\n  </script>\n  ","tag":["Cluster Rush","Platformer","Arcade","Reflex","Fast-Paced","Chaos","Obstacles","Jumping","Floor is Lava","Action","Challenge"],"rating":[4.6,460,27]}},"__N_SSG":true}