{"pageProps":{"game":{"date":"24-09-2025","brand":"Subway Surfers","orientation":0,"title":"Subway Surfers: Buenos Aires Unblocked Online","name":["Subway Surfers: Buenos","subway-surfers-buenos-aires"],"thumb":"/assets/thumb/subway-surfers-buenos-aires.png","thumb_big":"/assets/thumb/subway-surfers-buenos-aires.png","path":["/game/subway-surfers-buenos-aires","https://newunblockedgames.gitlab.io"],"iframe":"https://genizymath.github.io/iframe/134.html","Walkthrough":"https://www.youtube.com/embed/","s_dis":"Subway Surfers: Buenos Aires takes the endless runner action to Argentina’s capital, playable online unblocked with new city-themed characters, outfits, and hoverboards.","l_dis":"<h1>Subway Surfers: Buenos Aires – Dash Through the Streets of Argentina</h1>\n  <p><strong>Subway Surfers: Buenos Aires</strong> immerses players in the lively streets and landmarks of Buenos Aires. Run, jump, and slide along themed subway tracks, dodging trains and barriers while collecting coins, tokens, and power-ups.</p>\n\n  <h2 class=\"H22\">What is Subway Surfers: Buenos Aires?</h2>\n  <p>This World Tour edition features Buenos Aires-themed environments, characters like Sofia and Bruno, unique outfits, and new hoverboards. Collect city-specific items during Weekly Hunts for rewards.</p>\n\n  <h2 class=\"H22\">How to Play Subway Surfers: Buenos Aires?</h2>\n  <ul>\n    <li><strong>Swipe Controls:</strong> Swipe up to jump, down to roll, left/right to switch lanes.</li>\n    <li><strong>Collect Coins & City Tokens:</strong> Gather coins, themed collectibles, and other items to unlock Weekly Hunt rewards like hoverboards and keys.</li>\n    <li><strong>Dodge Obstacles:</strong> Avoid trains, barriers, and Buenos Aires-themed hazards while maintaining your run.</li>\n    <li><strong>Use Power-Ups:</strong> Activate magnets, jetpacks, and hoverboards to extend your run and maximize your score.</li>\n  </ul>\n\n  <h2 class=\"H22\">Why Play Subway Surfers: Buenos Aires Unblocked?</h2>\n  <p>Experience the lively streets of Buenos Aires in <strong>Subway Surfers: Buenos Aires</strong> online without restrictions, unlock new characters, outfits, boards, and city-themed collectibles.</p>\n\n  <h2 class=\"H22\">Key Features</h2>\n  <ul>\n    <li><strong>Buenos Aires Environment:</strong> Explore famous streets, cultural landmarks, and local architecture.</li>\n    <li><strong>Exclusive Characters & Boards:</strong> Play as Sofia and Bruno with unique city-themed hoverboards.</li>\n    <li><strong>Endless Runner Gameplay:</strong> Classic swipe-based controls with a Buenos Aires twist.</li>\n    <li><strong>Special Collectibles:</strong> Participate in Weekly Hunts for city-specific rewards.</li>\n    <li><strong>Unblocked Online:</strong> Play instantly in your browser anywhere.</li>\n  </ul>\n\n  <h2 class=\"H22\">Master Buenos Aires' Subway Tracks!</h2>\n  <p>Run, jump, and slide through <strong>Subway Surfers: Buenos Aires</strong> to beat obstacles, collect rewards, and enjoy the vibrant Argentinian city environment!</p>\n\n  <script type=\"application/ld+json\">\n  {\n    \"@context\": \"https://schema.org\",\n    \"@type\": \"FAQPage\",\n    \"mainEntity\": [\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What is Subway Surfers: Buenos Aires?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"It is a Buenos Aires-themed edition of Subway Surfers featuring city-specific characters, outfits, boards, and collectibles.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"How do you play Subway Surfers: Buenos Aires?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Swipe to jump, roll, and switch lanes while collecting coins, city tokens, and using power-ups to survive as long as possible.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Is Subway Surfers: Buenos Aires unblocked?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes, this edition is playable online without restrictions.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Who are the characters in Buenos Aires?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"The main characters include Sofia and Bruno with city-themed outfits.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What are the special collectibles in Buenos Aires?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Players collect city-specific tokens during Weekly Hunts for rewards like hoverboards and keys.\"\n        }\n      }\n    ]\n  }\n  </script>\n  ","tag":["Subway Surfers","Endless Runner","Buenos Aires","Argentina","Unblocked","World Tour"],"rating":[4.8,5321,478]}},"__N_SSG":true}