{"pageProps":{"game":{"date":"24-09-2025","brand":"Subway Surfers","orientation":0,"title":"Subway Surfers: New York Unblocked Online","name":["Subway Surfers: New York","subway-surfers-new-york"],"thumb":"/assets/thumb/subway-surfers-new-york.png","thumb_big":"/assets/thumb/subway-surfers-new-york.png","path":["/game/subway-surfers-new-york","https://newunblockedgames.gitlab.io"],"iframe":"https://subwaysurfersunblocked.gitlab.io/file/","Walkthrough":"https://www.youtube.com/embed/","s_dis":"Subway Surfers: New York is an endless runner World Tour edition where Jake and friends dodge trains, collect coins, and explore a vibrant New York City, all playable unblocked online.","l_dis":"<h1>Subway Surfers: New York – Endless Runner Adventure</h1>\n  <p><strong>Subway Surfers: New York</strong> brings the excitement of the World Tour edition to the Big Apple. Dash through subways, dodge trains, and collect coins while enjoying the colorful stylized landmarks of New York City.</p>\n  \n  <h2 class=\"H22\">What is Subway Surfers: New York?</h2>\n  <p>This edition of <strong>Subway Surfers</strong> is set in New York City. Players control Jake and his crew, escaping the pursuing inspector and his dog, all while navigating obstacles, performing jumps, and collecting power-ups and coins.</p>\n  \n  <h2 class=\"H22\">How to Play Subway Surfers: New York?</h2>\n  <ul>\n    <li><strong>Swipe Controls:</strong> Swipe up to jump, down to roll, and left/right to switch lanes.</li>\n    <li><strong>Collect Coins:</strong> Grab coins for points and unlock new characters and hoverboards.</li>\n    <li><strong>Avoid Obstacles:</strong> Dodge trains, barriers, and other hazards to keep running.</li>\n    <li><strong>Use Power-Ups:</strong> Activate magnets, jetpacks, and other boosts to maximize your score.</li>\n  </ul>\n  \n  <h2 class=\"H22\">Why Play Subway Surfers: New York Unblocked?</h2>\n  <p><strong>Unblocked access</strong> lets you enjoy endless runner action from anywhere, including school or work, without restrictions.</p>\n  \n  <h2 class=\"H22\">Key Features</h2>\n  <ul>\n    <li><strong>World Tour Experience:</strong> Explore New York City landmarks in a fun, stylized environment.</li>\n    <li><strong>Endless Running Fun:</strong> Classic Subway Surfers gameplay with fast-paced action.</li>\n    <li><strong>Power-Ups and Coins:</strong> Collect rewards to enhance gameplay and unlock new content.</li>\n    <li><strong>Vibrant Graphics:</strong> Colorful, dynamic visuals with iconic NYC scenery.</li>\n    <li><strong>Unblocked Online:</strong> Play instantly in a browser without downloads.</li>\n  </ul>\n  \n  <h2 class=\"H22\">Run the Subway, Rule the City!</h2>\n  <p>Dive into <strong>Subway Surfers: New York</strong> for high-speed thrills, coin collection, and a tour through the city that never sleeps. Swipe, dodge, and soar to become the ultimate subway surfer!</p>\n  \n  <script type=\"application/ld+json\">\n  {\n    \"@context\": \"https://schema.org\",\n    \"@type\": \"FAQPage\",\n    \"mainEntity\": [\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What is Subway Surfers: New York?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Subway Surfers: New York is a World Tour edition of Subway Surfers where players dash through NYC, dodging trains and collecting coins.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"How do you play Subway Surfers: New York?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Swipe to jump, roll, and switch lanes. Collect coins, avoid obstacles, and use power-ups to achieve high scores.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Is Subway Surfers: New York unblocked?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes, this version can be played online without restrictions, suitable for any network.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Can I unlock characters and hoverboards?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes, collecting coins and completing missions allows you to unlock new characters and hoverboards.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Does the game include NYC landmarks?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes, the New York edition highlights stylized versions of iconic NYC landmarks throughout the endless runner levels.\"\n        }\n      }\n    ]\n  }\n  </script>\n  ","tag":["Subway Surfers","Endless Runner","NYC","World Tour","Unblocked"],"rating":[4.7,12200,980]}},"__N_SSG":true}