{"pageProps":{"game":{"date":"19-11-2025","brand":"War the Knights","orientation":0,"title":"War the Knights – Medieval Action Strategy Game","name":["War the Knights","war-the-knights"],"thumb":"/assets/thumb/war-the-knights.png","thumb_big":"/assets/thumb/war-the-knights.png","path":["/game/war-the-knights","https://newunblockedgames.gitlab.io"],"iframe":"https://genizymath.github.io/iframe/284.html","Walkthrough":"https://www.youtube.com/embed/","s_dis":"War the Knights is a medieval action strategy game combining third-person combat and tactical troop management. Lead knights to victory with strategic planning, realistic physics, and large-scale battles featuring up to 200 warriors.","l_dis":"<h1>Play War the Knights – Medieval Action Strategy Game</h1>\n  <p><strong>War the Knights – Unblocked</strong> (also known as War The Knights: Battle Arena Swords 3D) blends hands-on medieval combat with tactical army management. Lead your knights across historical battlefields, capture flags, defeat enemies, and use strategy to claim victory.</p>\n\n  <h2 class=\"H22\">What is War the Knights?</h2>\n  <p><strong>War the Knights – Unblocked</strong> allows players to switch between third-person combat and a bird's eye view to deploy troops and plan tactics. Use shields, swords, and cavalry strategically while commanding up to 200 warriors simultaneously.</p>\n\n  <h2 class=\"H22\">How to Play War the Knights</h2>\n  <ul>\n    <li><strong>Engage in Third-Person Combat:</strong> Directly control your knight in melee and mounted combat.</li>\n    <li><strong>Command Your Army:</strong> Switch to a tactical view to deploy troops, form shield walls, and execute cavalry charges.</li>\n    <li><strong>Capture Objectives:</strong> Secure flags, defeat enemies, and control strategic points on the battlefield.</li>\n    <li><strong>Use Medieval Weapons:</strong> Equip swords, spears, axes, and other medieval gear to defeat opponents.</li>\n    <li><strong>Master Strategy and Physics:</strong> Balance hands-on combat with large-scale tactical decisions to dominate battles.</li>\n  </ul>\n\n  <h2 class=\"H22\">Why Play War the Knights?</h2>\n  <p>With realistic physics, large-scale battles, and a mix of action and strategy, <strong>War the Knights</strong> offers both an accessible experience for newcomers and deep tactical gameplay for veterans.</p>\n\n  <h2 class=\"H22\">Key Features</h2>\n  <ul>\n    <li><strong>Medieval Combat:</strong> Hands-on third-person sword and mounted combat.</li>\n    <li><strong>Army Command:</strong> Deploy and control troops tactically from a bird's eye view.</li>\n    <li><strong>Large Battles:</strong> Fight with up to 200 warriors on historical battlefields.</li>\n    <li><strong>Strategic Depth:</strong> Plan maneuvers, use terrain, and execute formations like shield walls.</li>\n    <li><strong>Realistic Physics:</strong> Experience authentic medieval weapon and combat dynamics.</li>\n  </ul>\n\n  <h2 class=\"H22\">Lead Your Knights to Glory</h2>\n  <p>Take command, fight bravely, and strategize wisely in <strong>War the Knights</strong> for an immersive medieval action strategy experience!</p>\n\n  <script type=\"application/ld+json\">\n  {\n    \"@context\": \"https://schema.org\",\n    \"@type\": \"FAQPage\",\n    \"mainEntity\": [\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What is War the Knights?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"War the Knights is a medieval action strategy game combining third-person combat with tactical army command on large battlefields.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Can you control troops in War the Knights?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes. Players can switch to a bird's eye view to deploy troops, plan tactics, and execute maneuvers.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"How many warriors can fight in War the Knights?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"The game supports battles with up to 200 warriors on the field simultaneously.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Does War the Knights include mounted combat?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes. Players can engage in mounted combat and lead cavalry charges alongside infantry.\"\n        }\n      }\n    ]\n  }\n  </script>\n  ","tag":["War the Knights","Medieval","Action","Strategy","Combat","Knights","Tactics","Army","Sword Fighting","Cavalry","Large-Scale Battles"],"rating":[4.6,560,42]}},"__N_SSG":true}