{"pageProps":{"game":{"date":"24-10-2025","brand":"Horde Killer: You vs 100","orientation":0,"title":"Horde Killer: You vs 100 Unblocked – Zombie Survival Shooter","name":["Horde Killer: You vs 100","horde-killer-you-vs-100"],"thumb":"/assets/thumb/horde-killer-you-vs-100.png","thumb_big":"/assets/thumb/horde-killer-you-vs-100.png","path":["/game/horde-killer-you-vs-100","https://newunblockedgames.gitlab.io"],"iframe":"https://classroomjq.github.io/gameshoottwo/horde-killer-you-vs-100/","Walkthrough":"https://www.youtube.com/embed/","s_dis":"Horde Killer: You vs 100 is a chaotic survival shooter where you face hordes of zombies, unlock new weapons and outfits, and fight to survive in an explosive apocalypse scenario.","l_dis":"<h1>Play Horde Killer: You vs 100 Unblocked – Zombie Survival Action</h1>\n  <p><strong>Horde Killer: You vs 100</strong> is a high-octane survival game where players face a massive horde of zombies. Use guns, explosives, and creative strategies to stay alive and buy new weapons and outfits for an explosively stylish apocalypse experience.</p>\n\n  <h2 class=\"H22\">What is Horde Killer: You vs 100?</h2>\n  <p><strong>Horde Killer: You vs 100</strong> is a chaotic shooter game where players are challenged to survive against 100 zombies at once. The game combines frantic combat, strategic shooting, and customization for weapons and outfits to enhance your apocalypse style.</p>\n\n  <h2 class=\"H22\">How to Play Horde Killer: You vs 100</h2>\n  <ul>\n    <li><strong>Shoot Zombies:</strong> Aim and shoot to eliminate hordes quickly.</li>\n    <li><strong>Use Explosives:</strong> Blow zombies to pieces using grenades or other explosives.</li>\n    <li><strong>Customize Weapons:</strong> Unlock and buy new guns for better firepower.</li>\n    <li><strong>Choose Outfits:</strong> Equip stylish outfits to survive in style.</li>\n    <li><strong>Survive the Horde:</strong> Avoid being mauled while strategically taking out zombies.</li>\n  </ul>\n\n  <h2 class=\"H22\">Why Play Horde Killer: You vs 100 Unblocked?</h2>\n  <p>Play <strong>Horde Killer: You vs 100</strong> unblocked online for free. Experience chaotic zombie survival with explosive action, weapon upgrades, and customizable outfits without downloads or installations.</p>\n\n  <h2 class=\"H22\">Key Features</h2>\n  <ul>\n    <li><strong>Face 100 Zombies:</strong> Challenging horde-based combat.</li>\n    <li><strong>Explosive Gameplay:</strong> Use guns, grenades, and other weapons creatively.</li>\n    <li><strong>Weapon Customization:</strong> Unlock new guns to improve survival.</li>\n    <li><strong>Stylish Outfits:</strong> Outfit your character for an apocalypse aesthetic.</li>\n    <li><strong>Unblocked Browser Play:</strong> Play instantly online with no downloads required.</li>\n  </ul>\n\n  <h2 class=\"H22\">Survive the Zombie Horde!</h2>\n  <p><strong>Horde Killer: You vs 100</strong> combines fast shooting, strategic survival, and explosive action. Fight through endless zombies, upgrade your gear, and stay alive. Play unblocked today and face the horde!</p>\n\n  <script type=\"application/ld+json\">\n  {\n    \"@context\": \"https://schema.org\",\n    \"@type\": \"FAQPage\",\n    \"mainEntity\": [\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What is Horde Killer: You vs 100?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Horde Killer: You vs 100 is a chaotic zombie survival shooter where players fight 100 zombies at once using weapons and explosives.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"How do you play Horde Killer: You vs 100?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Shoot zombies, use explosives strategically, unlock new weapons and outfits, and survive against the horde.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Can I play Horde Killer: You vs 100 unblocked?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes, Horde Killer: You vs 100 can be played unblocked online directly in your browser for free.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What makes Horde Killer: You vs 100 unique?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Its combination of massive zombie hordes, explosive combat, weapon upgrades, and customizable outfits makes the game chaotic and fun.\"\n        }\n      }\n    ]\n  }\n  </script>\n  ","tag":["Horde Killer","Shooting","Zombie","Survival","Action","Arcade","Unblocked","Browser Game"],"rating":[4.8,1030,90]}},"__N_SSG":true}