{"pageProps":{"game":{"date":"18-11-2025","brand":"They Are Coming","orientation":0,"title":"They Are Coming – Survive the Retro Zombie Horde","name":["They Are Coming","they-are-coming"],"thumb":"/assets/thumb/they-are-coming.png","thumb_big":"/assets/thumb/they-are-coming.png","path":["/game/they-are-coming","https://newunblockedgames.gitlab.io"],"iframe":"https://genizymath.github.io/iframe/348.html","Walkthrough":"https://www.youtube.com/embed/","s_dis":"\"They Are Coming\" is a roguelike, wave-based zombie survival game where players defend against relentless hordes, upgrade weapons, and survive day by day in retro 8-bit style.","l_dis":"<h1>Play They Are Coming – Fight Off Endless Zombie Waves</h1>\n  <p><strong>They Are Coming – Unblocked</strong> is a roguelike, wave-based zombie game where players control a lone survivor fending off hordes of zombies. Survive each day using weapons, traps, and items while earning money to upgrade for tougher challenges ahead.</p>\n\n  <h2 class=\"H22\">What is They Are Coming?</h2>\n  <p><strong>They Are Coming</strong> combines survival strategy with roguelike mechanics. Players face increasingly difficult zombie waves, managing resources, placing traps, and choosing weapons to maximize survival. The game features an 8-bit retro aesthetic and includes both hardcore survival and free-play \"Playground\" modes.</p>\n\n  <h2 class=\"H22\">How to Play They Are Coming</h2>\n  <ul>\n    <li><strong>Survive Waves:</strong> Fight off zombies in each day and last as long as possible.</li>\n    <li><strong>Use Weapons and Traps:</strong> Strategically place traps and use weapons to maximize kills.</li>\n    <li><strong>Earn Money:</strong> Collect rewards from zombies to purchase upgrades for the next day.</li>\n    <li><strong>Upgrade Gear:</strong> Improve weapons, traps, and abilities to handle tougher waves.</li>\n    <li><strong>Playground Mode:</strong> Experiment with strategies and setups without pressure.</li>\n  </ul>\n\n  <h2 class=\"H22\">Why Play They Are Coming?</h2>\n  <p>The game offers retro 8-bit graphics, challenging roguelike gameplay, and rewarding progression. Fans of survival, strategy, and hardcore difficulty will enjoy the mix of tactical combat and resource management.</p>\n\n  <h2 class=\"H22\">Key Features</h2>\n  <ul>\n    <li><strong>Roguelike Survival:</strong> Each day presents new challenges and harder zombie waves.</li>\n    <li><strong>Wave-Based Combat:</strong> Defend against hordes using strategy and skill.</li>\n    <li><strong>Retro 8-Bit Aesthetic:</strong> Nostalgic pixel-style graphics with classic gameplay feel.</li>\n    <li><strong>Upgrade System:</strong> Earn rewards to improve weapons, traps, and survivability.</li>\n    <li><strong>Playground Mode:</strong> Freely experiment with weapons and traps.</li>\n  </ul>\n\n  <h2 class=\"H22\">Can You Survive the Horde?</h2>\n  <p>Face relentless zombie waves, upgrade your gear, and see how long you can last in <strong>They Are Coming</strong>!</p>\n\n  <script type=\"application/ld+json\">\n  {\n    \"@context\": \"https://schema.org\",\n    \"@type\": \"FAQPage\",\n    \"mainEntity\": [\n      {\n        \"@type\": \"Question\",\n        \"name\": \"What is They Are Coming?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"They Are Coming is a roguelike, wave-based zombie survival game where players fight hordes, use traps and weapons, and survive day by day in retro 8-bit style.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"How do you play They Are Coming?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Players survive zombie waves using weapons, traps, and items, earn money, and upgrade gear to handle tougher challenges each day.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Does They Are Coming have a free-play mode?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"Yes. The Playground mode allows players to experiment with setups and strategies without the pressure of survival.\"\n        }\n      },\n      {\n        \"@type\": \"Question\",\n        \"name\": \"Why play They Are Coming?\",\n        \"acceptedAnswer\": {\n          \"@type\": \"Answer\",\n          \"text\": \"It offers challenging roguelike survival gameplay with retro 8-bit visuals, tactical combat, and rewarding progression.\"\n        }\n      }\n    ]\n  }\n  </script>\n  ","tag":["They Are Coming","Zombie","Roguelike","Survival","Wave-Based","Strategy","8-Bit","Retro","Traps","Weapons","Playground Mode","Unblocked","Hardcore"],"rating":[4.7,2190,142]}},"__N_SSG":true}